[
  {
    "name": "Terraform",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Infrastructure as Code tool from HashiCorp that is used to manage infrastructure. Still the most commonly used IaC framework out there and uses a very simple and structured DSL to deploy resources and configuration to cloud providers and SaaS tools. The teams use this to deploy landingzones and resources for our services in Checkatrade with the support of Platform managed modules."
  },
  {
    "name": "Github Copilot",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "GitHub Copilot is an AI-powered coding assistant developed by OpenAI and GitHub. It provides real-time code suggestions and auto-completion based on context, allowing developers to write code faster and more efficiently by leveraging machine learning models trained on vast code repositories. It is currently in technical preview and only available to a limited number of users."
  },
  {
    "name": "ChatGPT",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "ChatGPT is an AI language model developed by OpenAI. It uses deep learning techniques to generate human-like text responses in conversational contexts. Trained on a vast amount of data, ChatGPT can understand and generate text across various topics, making it useful for a wide range of applications such as chatbots, content generation, and language assistance."
  },
  {
    "name": "Github Actions",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "GitHub Actions is a powerful workflow automation and CI/CD platform provided by GitHub. It enables developers to automate tasks, build, test, and deploy applications directly from their GitHub repositories. With a wide range of predefined actions and customizable workflows, GitHub Actions simplifies the software development process and enhances collaboration among development teams."
  },
  {
    "name": "Codefresh",
    "ring": "hold",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Codefresh is a continuous integration and delivery (CI/CD) platform designed for Docker and Kubernetes-based applications. It simplifies the development lifecycle by providing automated building, testing, and deployment processes. With features like reusable pipelines, environment management, and integrations, Codefresh helps teams streamline their software delivery pipelines and accelerate application development."
  },
  {
    "name": "Bitrise",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Bitrise is a cloud-based continuous integration and delivery (CI/CD) platform for mobile app development. It automates build, test, and deployment processes, supporting iOS and Android applications. With features like code signing, device testing, and integrations with popular tools, Bitrise simplifies the mobile app development workflow and facilitates collaboration among teams."
  },
  {
    "name": "Browserstack",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "BrowserStack is a cloud-based platform that provides real device and browser testing for web and mobile applications. It offers a comprehensive range of virtual machines and physical devices to perform cross-browser and cross-platform testing. With features like automated testing, debugging tools, and integrations, BrowserStack helps ensure seamless functionality and user experience across different environments."
  },
  {
    "name": "PowerBI",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Power BI is a business intelligence and data visualization platform by Microsoft. It enables users to connect, transform, and visualize data from various sources into interactive reports and dashboards. With its rich set of tools and capabilities, Power BI empowers organizations to gain insights, make data-driven decisions, and share information effectively."
  },
  {
    "name": "K6",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "k6 is an open-source load testing tool used to test the performance and scalability of web applications and APIs. It supports script creation in JavaScript, providing flexibility for test scenarios. With its simple CLI and rich metrics output, k6 allows developers to simulate realistic user loads and analyze application performance under stress conditions."
  },
  {
    "name": "Kubernetes",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Kubernetes is an open-source container orchestration platform that automates the deployment, scaling, and management of containerized applications. It provides features like automatic scaling, load balancing, self-healing, and service discovery. With Kubernetes, organizations can effectively manage and run applications in a resilient, scalable, and portable manner across various environments."
  },
  {
    "name": "LuanchDarkly",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "LaunchDarkly is a feature management platform that enables organizations to control the release and targeting of features in their software applications. It provides feature flags, allowing developers to easily toggle features on/off for different user segments. With its robust feature management capabilities, LaunchDarkly helps teams deliver software faster, reduce risk, and provide personalized experiences to users."
  },
  {
    "name": "Codigy",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "Codigy is a tool for repository visualizations and understanding relations between code, it can also produce engineering metrics based on DORA and other metrics. It is a tool that can be used to understand the codebase and the relationships between the code."
  },
  {
    "name": "Code Climate Velocity",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "TRUE",
    "description": "CCode Climate Velocity is a software engineering analytics platform that provides insights into team productivity and code quality. It analyzes data from code repositories and issue tracking systems to measure team performance, identify bottlenecks, and deliver actionable recommendations for improving engineering processes and efficiency."
  },
  {
    "name": "Atlassian JIRA",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Jira is a widely used project management and issue tracking software by Atlassian. It helps teams plan, track, and manage projects and tasks. With features like customizable workflows, agile boards, reporting, and integration options, Jira facilitates collaboration, improves productivity, and provides visibility into the progress and status of projects."
  },
  {
    "name": "Atlassian Confluence",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Atlassian Confluence is a collaboration and documentation platform that enables teams to create, organize, and share knowledge. It provides tools for creating pages, blogs, and spaces, allowing teams to collaborate, document processes, track project progress, and foster knowledge sharing within the organization. Confluence improves team productivity and promotes effective collaboration."
  },
  {
    "name": "Jenkins",
    "ring": "hold",
    "quadrant": "tools",
    "isNew": "FALSE",
    "description": "Jenkins is an open-source automation server that allows teams to build, test, and deploy software applications. It offers a wide range of plugins, enabling continuous integration and continuous delivery (CI/CD) workflows. With its extensibility, scalability, and flexibility, Jenkins streamlines the software development process and automates repetitive tasks, enhancing productivity and quality."
  },
  {
    "name": "Event Driven Architecture",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "description": "Event-driven architecture (EDA) is a software design pattern that emphasizes the production, detection, and consumption of events. Events represent significant occurrences or changes in a system, and components communicate by publishing and subscribing to events. EDA promotes loose coupling, scalability, and flexibility, enabling systems to react and respond to events in a decoupled and asynchronous manner. It allows for event-driven workflows, real-time processing, and easier integration with external systems and services."
  },
  {
    "name": "CI/CD as service",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "description": "CI/CD as a service (Continuous Integration/Continuous Deployment) refers to standardised frameworks in Checkatrade that automate the processes of building, testing, and deploying software applications. It provides seamless integration with version control systems, facilitates collaboration among development teams, and enables efficient and reliable software delivery pipelines, ensuring faster time to market and higher software quality."
  },
  {
    "name": "Zero trust segmentation",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "description": "Zero Trust Segmentation for applications extends the principles of Zero Trust to application-level security. It involves segmenting applications into smaller components, enforcing access controls based on user identity, device posture, and other contextual factors. By implementing fine-grained access controls and monitoring, it reduces the risk of unauthorized access, lateral movement, and potential application-level breaches."
  },
  {
    "name": "Data Mesh",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "description": "Data Mesh is an architectural approach that decentralizes data ownership and governance, treating data as a product. It advocates for self-serve data infrastructure, domain-oriented data teams, and data productization. Data Mesh aims to improve data quality, enable faster insights, and foster a culture of data-driven decision-making in organizations."
  },
  {
    "name": "Amazon Web Services",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Amazon Web Services (AWS) is a comprehensive cloud computing platform offered by Amazon. It provides a vast array of services including computing power, storage, databases, AI/ML, networking, and more. With global data centers, scalability, and pay-as-you-go pricing, AWS enables organizations to build and deploy applications and services with flexibility, security, and reliability."
  },
  {
    "name": "Google Cloud Platform",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Google Cloud Platform (GCP) is a suite of cloud computing services provided by Google. It offers a wide range of tools and services for building, deploying, and managing applications and infrastructure in a scalable and secure manner. GCP provides services such as computing, storage, databases, AI/ML, networking, and more, enabling organizations to leverage the power of the cloud for their business needs."
  },
  {
    "name": "Azure",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Azure is Microsoft's cloud computing platform, offering a wide range of services for building, deploying, and managing applications and services. It provides scalable computing power, storage, databases, AI/ML capabilities, and more. With its global presence, security features, and integration options, Azure empowers organizations to leverage the cloud for their business needs."
  },
  {
    "name": "Snyk",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Snyk is a developer-first security platform that helps identify and fix vulnerabilities in open-source libraries and container images. It integrates seamlessly into the development workflow, providing real-time vulnerability scanning, automated patching, and actionable insights to enhance the security posture of applications and infrastructure."
  },
  {
    "name": "Datadog",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Datadog is a monitoring and analytics platform that provides real-time insights into the performance and health of IT infrastructure, applications, and services. It offers monitoring, alerting, and visualization features, enabling organizations to optimize system performance, detect issues, and troubleshoot problems efficiently, ensuring reliable and efficient operation of their digital systems."
  },
  {
    "name": "Darktrace",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Darktrace is an AI-powered cybersecurity platform that uses machine learning algorithms to detect and respond to cyber threats in real-time. It monitors network traffic, identifies anomalous behavior, and provides autonomous threat response to protect against advanced cyber attacks. Darktrace helps organizations defend their digital assets and safeguard against emerging threats."
  },
  {
    "name": "Retool",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Retool is a low-code development platform that empowers users to build internal tools quickly. It offers a drag-and-drop interface to create custom applications, dashboards, and workflows that connect to various data sources. Retool enables teams to streamline workflows, improve operational efficiency, and enhance data-driven decision-making within their organizations."
  },
  {
    "name": "VertexAI",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "description": "Vertex AI is a machine learning platform offered by Google Cloud. It provides a unified and fully managed environment for developing, deploying, and scaling AI models. With features like AutoML, custom training, and pre-trained models, Vertex AI simplifies the machine learning workflow and enables organizations to harness the power of AI for their applications and services."
  },
  {
    "name": "Mulesoft",
    "ring": "hold",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "MuleSoft is an integration platform that enables developers to connect applications, data, and devices across on-premises and cloud environments. It provides a unified platform for API management, data integration, and application integration, allowing organizations to build a connected enterprise. MuleSoft is used by the Platform team to integrate various systems and services within Checkatrade. All new development on the mulesoft platform should cease."
  },
  {
    "name": "Salesforce",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Salesforce is a leading customer relationship management (CRM) platform that helps businesses manage their sales, marketing, and customer service operations. It provides a suite of cloud-based applications and tools for automating processes, tracking customer interactions, analyzing data, and fostering collaboration. Salesforce offers scalability, customization, and integration capabilities to drive business growth and improve customer experiences."
  },
  {
    "name": "Zuora",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Zuora is a subscription management platform that helps businesses manage their subscription-based products and services. It offers capabilities for billing, payments, revenue recognition, and analytics, enabling organizations to streamline subscription operations, optimize pricing strategies, and drive recurring revenue growth."
  },
  {
    "name": "Cloudflare",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "description": "Cloudflare is a global cloud-based platform that provides a range of services to optimize and secure websites and applications. It offers content delivery network (CDN) services, DDoS protection, web application firewall (WAF), load balancing, DNS management, and other performance-enhancing features. Cloudflare improves website speed, availability, and security while reducing bandwidth costs."
  },
  {
    "name": "TypeScript",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "TypeScript is a statically typed superset of JavaScript that adds optional type annotations and compile-time type checking. It provides developers with enhanced tooling, improved code maintainability, and better error detection. TypeScript compiles to plain JavaScript, making it compatible with existing JavaScript codebases while adding static typing benefits."
  },
  {
    "name": "Dotnet 6",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": ".NET is a free, open-source framework for building various applications. It offers cross-platform support, performance improvements, enhanced APIs, and tooling for developing web, mobile, desktop, cloud, and IoT applications."
  },
  {
    "name": "React",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "React is a popular JavaScript library for building user interfaces. It allows developers to create reusable UI components that update efficiently and declaratively. With its virtual DOM and component-based architecture, React simplifies UI development, improves performance, and enables building dynamic and interactive web applications with ease."
  },
  {
    "name": "React Native",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "React Native is a framework for building native mobile applications using JavaScript and React. It allows developers to write code once and deploy it across multiple platforms, including iOS and Android. With its cross-platform capabilities and reusable components, React Native enables efficient and rapid development of mobile apps."
  },
  {
    "name": "NextJS",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "Next.js is a React framework for building server-side rendered (SSR) and statically generated (SSG) web applications. It offers features like automatic code splitting, server-side rendering, and static site generation. With built-in routing, API routes, and an intuitive file-based routing system, Next.js simplifies development and enables fast and scalable web applications."
  },
  {
    "name": "Golang",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "Go (or Golang) is a statically-typed, compiled programming language created by Google. It is designed for efficiency, simplicity, and concurrency. Go offers strong support for concurrent programming, a garbage collector, built-in tooling, and an extensive standard library, making it suitable for building scalable and performant software applications."
  },
  {
    "name": "Python3",
    "ring": "adopt",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "Python 3 is a popular interpreted, high-level programming language known for its simplicity and readability. It offers a vast ecosystem of libraries and frameworks, making it versatile for various domains. With its easy syntax, dynamic typing, and support for multiple platforms, Python 3 is widely used for web development, data analysis, AI/ML, automation, and more."
  },
  {
    "name": "Ruby",
    "ring": "hold",
    "quadrant": "languages & frameworks",
    "isNew": "FALSE",
    "description": "Still used in a few services, should be discontinued"
  }
]